#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.alz.random_id.telem[0]: Refreshing state... [id=0lSmFA]
module.alz.azurerm_subscription_template_deployment.telemetry_core[0]: Refreshing state... [id=/subscriptions/6e06f118-5146-4357-a5cc-7329340def38/providers/Microsoft.Resources/deployments/pid-36dcde81-8c33-4da0-8dc3-265381502ccb_v4.2.0_0000_d254a614]
module.alz.azurerm_resource_group.connectivity["/subscriptions/6e06f118-5146-4357-a5cc-7329340def38/resourceGroups/atlz-dev-connectivity-northeurope"]: Refreshing state... [id=/subscriptions/6e06f118-5146-4357-a5cc-7329340def38/resourceGroups/atlz-dev-connectivity-northeurope]
module.alz.azurerm_resource_group.connectivity["/subscriptions/6e06f118-5146-4357-a5cc-7329340def38/resourceGroups/atlz-dev-connectivity-westeurope"]: Refreshing state... [id=/subscriptions/6e06f118-5146-4357-a5cc-7329340def38/resourceGroups/atlz-dev-connectivity-westeurope]
module.alz.azurerm_subscription_template_deployment.telemetry_connectivity[0]: Refreshing state... [id=/subscriptions/6e06f118-5146-4357-a5cc-7329340def38/providers/Microsoft.Resources/deployments/pid-97603aac-98f8-4a55-92fc-4c78378c9ba5_v4.2.0_0001_d254a614]
module.alz.time_sleep.after_azurerm_management_group: Refreshing state... [id=2024-10-28T19:20:49Z]
module.alz.time_sleep.after_azurerm_policy_definition: Refreshing state... [id=2024-10-28T19:21:19Z]
module.alz.time_sleep.after_azurerm_role_definition: Refreshing state... [id=2024-10-28T19:21:49Z]
module.alz.time_sleep.after_azurerm_policy_set_definition: Refreshing state... [id=2024-10-28T19:21:49Z]
module.alz.time_sleep.after_azurerm_policy_assignment: Refreshing state... [id=2024-10-28T19:22:19Z]
module.alz.time_sleep.after_azurerm_role_assignment: Refreshing state... [id=2024-10-28T19:22:20Z]
module.alz.azurerm_virtual_network.connectivity["/subscriptions/6e06f118-5146-4357-a5cc-7329340def38/resourceGroups/atlz-dev-connectivity-northeurope/providers/Microsoft.Network/virtualNetworks/atlz-dev-hub-northeurope"]: Refreshing state... [id=/subscriptions/6e06f118-5146-4357-a5cc-7329340def38/resourceGroups/atlz-dev-connectivity-northeurope/providers/Microsoft.Network/virtualNetworks/atlz-dev-hub-northeurope]
module.alz.azurerm_virtual_network.connectivity["/subscriptions/6e06f118-5146-4357-a5cc-7329340def38/resourceGroups/atlz-dev-connectivity-westeurope/providers/Microsoft.Network/virtualNetworks/atlz-dev-hub-westeurope"]: Refreshing state... [id=/subscriptions/6e06f118-5146-4357-a5cc-7329340def38/resourceGroups/atlz-dev-connectivity-westeurope/providers/Microsoft.Network/virtualNetworks/atlz-dev-hub-westeurope]
module.alz.azurerm_virtual_network_peering.connectivity["/subscriptions/6e06f118-5146-4357-a5cc-7329340def38/resourceGroups/atlz-dev-connectivity-northeurope/providers/Microsoft.Network/virtualNetworks/atlz-dev-hub-northeurope/virtualNetworkPeerings/peering-a7b7edd0-015d-50e3-abbc-a12bdd996785"]: Refreshing state... [id=/subscriptions/6e06f118-5146-4357-a5cc-7329340def38/resourceGroups/atlz-dev-connectivity-northeurope/providers/Microsoft.Network/virtualNetworks/atlz-dev-hub-northeurope/virtualNetworkPeerings/peering-a7b7edd0-015d-50e3-abbc-a12bdd996785]
module.alz.azurerm_virtual_network_peering.connectivity["/subscriptions/6e06f118-5146-4357-a5cc-7329340def38/resourceGroups/atlz-dev-connectivity-westeurope/providers/Microsoft.Network/virtualNetworks/atlz-dev-hub-westeurope/virtualNetworkPeerings/peering-f4cbc185-0b35-5c16-9fd2-c650354d07b5"]: Refreshing state... [id=/subscriptions/6e06f118-5146-4357-a5cc-7329340def38/resourceGroups/atlz-dev-connectivity-westeurope/providers/Microsoft.Network/virtualNetworks/atlz-dev-hub-westeurope/virtualNetworkPeerings/peering-f4cbc185-0b35-5c16-9fd2-c650354d07b5]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.alz.azurerm_resource_group.connectivity["/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/atlz-dev-connectivity-northeurope"] will be created
  + resource "azurerm_resource_group" "connectivity" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "atlz-dev-connectivity-northeurope"
      + tags     = {
          + "demo_type"  = "Deploy connectivity resources using multiple module declarations"
          + "deployedBy" = "terraform/azure/caf-enterprise-scale/examples/l400-multi"
        }
    }

  # module.alz.azurerm_resource_group.connectivity["/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/atlz-dev-connectivity-westeurope"] will be created
  + resource "azurerm_resource_group" "connectivity" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "atlz-dev-connectivity-westeurope"
      + tags     = {
          + "demo_type"  = "Deploy connectivity resources using multiple module declarations"
          + "deployedBy" = "terraform/azure/caf-enterprise-scale/examples/l400-multi"
        }
    }

  # module.alz.azurerm_resource_group.connectivity["/subscriptions/6e06f118-5146-4357-a5cc-7329340def38/resourceGroups/atlz-dev-connectivity-northeurope"] will be destroyed
  # (because key ["/subscriptions/6e06f118-5146-4357-a5cc-7329340def38/resourceGroups/atlz-dev-connectivity-northeurope"] is not in for_each map)
  - resource "azurerm_resource_group" "connectivity" {
      - id       = "/subscriptions/6e06f118-5146-4357-a5cc-7329340def38/resourceGroups/atlz-dev-connectivity-northeurope" -> null
      - location = "northeurope" -> null
      - name     = "atlz-dev-connectivity-northeurope" -> null
      - tags     = {
          - "demo_type"  = "Deploy connectivity resources using multiple module declarations"
          - "deployedBy" = "terraform/azure/caf-enterprise-scale/examples/l400-multi"
        } -> null
    }

  # module.alz.azurerm_resource_group.connectivity["/subscriptions/6e06f118-5146-4357-a5cc-7329340def38/resourceGroups/atlz-dev-connectivity-westeurope"] will be destroyed
  # (because key ["/subscriptions/6e06f118-5146-4357-a5cc-7329340def38/resourceGroups/atlz-dev-connectivity-westeurope"] is not in for_each map)
  - resource "azurerm_resource_group" "connectivity" {
      - id       = "/subscriptions/6e06f118-5146-4357-a5cc-7329340def38/resourceGroups/atlz-dev-connectivity-westeurope" -> null
      - location = "westeurope" -> null
      - name     = "atlz-dev-connectivity-westeurope" -> null
      - tags     = {
          - "demo_type"  = "Deploy connectivity resources using multiple module declarations"
          - "deployedBy" = "terraform/azure/caf-enterprise-scale/examples/l400-multi"
        } -> null
    }

  # module.alz.azurerm_virtual_network.connectivity["/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/atlz-dev-connectivity-northeurope/providers/Microsoft.Network/virtualNetworks/atlz-dev-hub-northeurope"] will be created
  + resource "azurerm_virtual_network" "connectivity" {
      + address_space       = [
          + "10.101.0.0/22",
        ]
      + dns_servers         = []
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "atlz-dev-hub-northeurope"
      + resource_group_name = "atlz-dev-connectivity-northeurope"
      + subnet              = (known after apply)
      + tags                = {
          + "demo_type"  = "Deploy connectivity resources using multiple module declarations"
          + "deployedBy" = "terraform/azure/caf-enterprise-scale/examples/l400-multi"
        }
    }

  # module.alz.azurerm_virtual_network.connectivity["/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/atlz-dev-connectivity-westeurope/providers/Microsoft.Network/virtualNetworks/atlz-dev-hub-westeurope"] will be created
  + resource "azurerm_virtual_network" "connectivity" {
      + address_space       = [
          + "10.100.0.0/22",
        ]
      + dns_servers         = []
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "atlz-dev-hub-westeurope"
      + resource_group_name = "atlz-dev-connectivity-westeurope"
      + subnet              = (known after apply)
      + tags                = {
          + "demo_type"  = "Deploy connectivity resources using multiple module declarations"
          + "deployedBy" = "terraform/azure/caf-enterprise-scale/examples/l400-multi"
        }
    }

  # module.alz.azurerm_virtual_network.connectivity["/subscriptions/6e06f118-5146-4357-a5cc-7329340def38/resourceGroups/atlz-dev-connectivity-northeurope/providers/Microsoft.Network/virtualNetworks/atlz-dev-hub-northeurope"] will be destroyed
  # (because key ["/subscriptions/6e06f118-5146-4357-a5cc-7329340def38/resourceGroups/atlz-dev-connectivity-northeurope/providers/Microsoft.Network/virtualNetworks/atlz-dev-hub-northeurope"] is not in for_each map)
  - resource "azurerm_virtual_network" "connectivity" {
      - address_space           = [
          - "10.101.0.0/22",
        ] -> null
      - dns_servers             = [] -> null
      - flow_timeout_in_minutes = 0 -> null
      - guid                    = "975b0a1b-499a-4e77-855f-fbc7cb285246" -> null
      - id                      = "/subscriptions/6e06f118-5146-4357-a5cc-7329340def38/resourceGroups/atlz-dev-connectivity-northeurope/providers/Microsoft.Network/virtualNetworks/atlz-dev-hub-northeurope" -> null
      - location                = "northeurope" -> null
      - name                    = "atlz-dev-hub-northeurope" -> null
      - resource_group_name     = "atlz-dev-connectivity-northeurope" -> null
      - subnet                  = [] -> null
      - tags                    = {
          - "demo_type"  = "Deploy connectivity resources using multiple module declarations"
          - "deployedBy" = "terraform/azure/caf-enterprise-scale/examples/l400-multi"
        } -> null
    }

  # module.alz.azurerm_virtual_network.connectivity["/subscriptions/6e06f118-5146-4357-a5cc-7329340def38/resourceGroups/atlz-dev-connectivity-westeurope/providers/Microsoft.Network/virtualNetworks/atlz-dev-hub-westeurope"] will be destroyed
  # (because key ["/subscriptions/6e06f118-5146-4357-a5cc-7329340def38/resourceGroups/atlz-dev-connectivity-westeurope/providers/Microsoft.Network/virtualNetworks/atlz-dev-hub-westeurope"] is not in for_each map)
  - resource "azurerm_virtual_network" "connectivity" {
      - address_space           = [
          - "10.100.0.0/22",
        ] -> null
      - dns_servers             = [] -> null
      - flow_timeout_in_minutes = 0 -> null
      - guid                    = "e9969a8d-4b69-405f-bb8e-42cc4b086d8f" -> null
      - id                      = "/subscriptions/6e06f118-5146-4357-a5cc-7329340def38/resourceGroups/atlz-dev-connectivity-westeurope/providers/Microsoft.Network/virtualNetworks/atlz-dev-hub-westeurope" -> null
      - location                = "westeurope" -> null
      - name                    = "atlz-dev-hub-westeurope" -> null
      - resource_group_name     = "atlz-dev-connectivity-westeurope" -> null
      - subnet                  = [] -> null
      - tags                    = {
          - "demo_type"  = "Deploy connectivity resources using multiple module declarations"
          - "deployedBy" = "terraform/azure/caf-enterprise-scale/examples/l400-multi"
        } -> null
    }

  # module.alz.azurerm_virtual_network_peering.connectivity["/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/atlz-dev-connectivity-northeurope/providers/Microsoft.Network/virtualNetworks/atlz-dev-hub-northeurope/virtualNetworkPeerings/peering-58382a7d-55bb-507e-983b-671b587da013"] will be created
  + resource "azurerm_virtual_network_peering" "connectivity" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = true
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "peering-58382a7d-55bb-507e-983b-671b587da013"
      + remote_virtual_network_id    = "/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/atlz-dev-connectivity-westeurope/providers/Microsoft.Network/virtualNetworks/atlz-dev-hub-westeurope"
      + resource_group_name          = "atlz-dev-connectivity-northeurope"
      + use_remote_gateways          = false
      + virtual_network_name         = "atlz-dev-hub-northeurope"
    }

  # module.alz.azurerm_virtual_network_peering.connectivity["/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/atlz-dev-connectivity-westeurope/providers/Microsoft.Network/virtualNetworks/atlz-dev-hub-westeurope/virtualNetworkPeerings/peering-175ffba4-7200-5d73-b22f-9e8e7fa78c09"] will be created
  + resource "azurerm_virtual_network_peering" "connectivity" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = true
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "peering-175ffba4-7200-5d73-b22f-9e8e7fa78c09"
      + remote_virtual_network_id    = "/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/atlz-dev-connectivity-northeurope/providers/Microsoft.Network/virtualNetworks/atlz-dev-hub-northeurope"
      + resource_group_name          = "atlz-dev-connectivity-westeurope"
      + use_remote_gateways          = false
      + virtual_network_name         = "atlz-dev-hub-westeurope"
    }

  # module.alz.azurerm_virtual_network_peering.connectivity["/subscriptions/6e06f118-5146-4357-a5cc-7329340def38/resourceGroups/atlz-dev-connectivity-northeurope/providers/Microsoft.Network/virtualNetworks/atlz-dev-hub-northeurope/virtualNetworkPeerings/peering-a7b7edd0-015d-50e3-abbc-a12bdd996785"] will be destroyed
  # (because key ["/subscriptions/6e06f118-5146-4357-a5cc-7329340def38/resourceGroups/atlz-dev-connectivity-northeurope/providers/Microsoft.Network/virtualNetworks/atlz-dev-hub-northeurope/virtualNetworkPeerings/peering-a7b7edd0-015d-50e3-abbc-a12bdd996785"] is not in for_each map)
  - resource "azurerm_virtual_network_peering" "connectivity" {
      - allow_forwarded_traffic      = true -> null
      - allow_gateway_transit        = true -> null
      - allow_virtual_network_access = true -> null
      - id                           = "/subscriptions/6e06f118-5146-4357-a5cc-7329340def38/resourceGroups/atlz-dev-connectivity-northeurope/providers/Microsoft.Network/virtualNetworks/atlz-dev-hub-northeurope/virtualNetworkPeerings/peering-a7b7edd0-015d-50e3-abbc-a12bdd996785" -> null
      - name                         = "peering-a7b7edd0-015d-50e3-abbc-a12bdd996785" -> null
      - remote_virtual_network_id    = "/subscriptions/6e06f118-5146-4357-a5cc-7329340def38/resourceGroups/atlz-dev-connectivity-westeurope/providers/Microsoft.Network/virtualNetworks/atlz-dev-hub-westeurope" -> null
      - resource_group_name          = "atlz-dev-connectivity-northeurope" -> null
      - use_remote_gateways          = false -> null
      - virtual_network_name         = "atlz-dev-hub-northeurope" -> null
    }

  # module.alz.azurerm_virtual_network_peering.connectivity["/subscriptions/6e06f118-5146-4357-a5cc-7329340def38/resourceGroups/atlz-dev-connectivity-westeurope/providers/Microsoft.Network/virtualNetworks/atlz-dev-hub-westeurope/virtualNetworkPeerings/peering-f4cbc185-0b35-5c16-9fd2-c650354d07b5"] will be destroyed
  # (because key ["/subscriptions/6e06f118-5146-4357-a5cc-7329340def38/resourceGroups/atlz-dev-connectivity-westeurope/providers/Microsoft.Network/virtualNetworks/atlz-dev-hub-westeurope/virtualNetworkPeerings/peering-f4cbc185-0b35-5c16-9fd2-c650354d07b5"] is not in for_each map)
  - resource "azurerm_virtual_network_peering" "connectivity" {
      - allow_forwarded_traffic      = true -> null
      - allow_gateway_transit        = true -> null
      - allow_virtual_network_access = true -> null
      - id                           = "/subscriptions/6e06f118-5146-4357-a5cc-7329340def38/resourceGroups/atlz-dev-connectivity-westeurope/providers/Microsoft.Network/virtualNetworks/atlz-dev-hub-westeurope/virtualNetworkPeerings/peering-f4cbc185-0b35-5c16-9fd2-c650354d07b5" -> null
      - name                         = "peering-f4cbc185-0b35-5c16-9fd2-c650354d07b5" -> null
      - remote_virtual_network_id    = "/subscriptions/6e06f118-5146-4357-a5cc-7329340def38/resourceGroups/atlz-dev-connectivity-northeurope/providers/Microsoft.Network/virtualNetworks/atlz-dev-hub-northeurope" -> null
      - resource_group_name          = "atlz-dev-connectivity-westeurope" -> null
      - use_remote_gateways          = false -> null
      - virtual_network_name         = "atlz-dev-hub-westeurope" -> null
    }

Plan: 6 to add, 0 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>